# Reference Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Point..::..Reference Property
Point Class See Also
---
Returns a stable reference to the point.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Reference Reference { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Reference As Reference
	Get
```

Visual C++
---
```text
public:
property Reference^ Reference {
	Reference^ get ();
}
```

# Remarks
This value is if the corresponding geometry object does not permit referencing.
# See Also
Point Class
Autodesk.Revit.DB Namespace